# Реализовать склонение слова «процент» во фразе «N процентов».
# Интервал от 1 до 101
# процент - 1, 21, 31,
# процента - 2,3, 4, 22,23,24, 32,33,34,
# процентов - 5, 6, 7, 8,9,10,11,12,13,14,15,16,17,18,19,20,25,26,27,28,29,30,35,36,200

number = 0
n = 101
while number <= n:
    if number >=11 and number < 15:
        print(number, 'процентов')
    elif number % 10 == 1:
        print(number,'процент')
    elif number % 10 >= 2 and  number % 10 < 5:
        print(number, 'процента')
    else:
        print(number, 'процентов')
    number += 1

